artillery-tests/querystring.yml
config:
  target: 'https://reqres.in/api'
  phases:
    - name: "Test with query string"
      duration: 5
      arrivalRate: 2
      rampTo: 2

  plugins:
    expect: {}

scenarios:
  - name: "Get a single user"
    flow:
        - get:
            url: "/users"
            qs:
              page: 2
            expect:
              - statusCode: 200
              - contentType: json